[ORIENTATION:1]
LEVEL= 1
DESC=区域1与区域2提取面积差异不大
FIT=

[PIN1:1]
LEVEL= 1
DESC=学习区域为空
FIT=请选择合适的区域

[PIN1:2]
LEVEL= 1
DESC=灰度模板学习失败
FIT=请选择合适的区域、检查图像

[PIN1:3]
LEVEL= 1
DESC=学习区域中没有找到圆
FIT=请选择合适的区域，尽量使得区域和圆的外接矩形相似

[PIN1:4]
LEVEL= 1
DESC=两个检测方法都没有选中
FIT=请至少选择一种合适的检测方法

[PIN1:5]
LEVEL= 1
DESC=没有完成学习过程
FIT=请首先调用学习方法进行学习

[PIN1:6]
LEVEL= 1
DESC=有检测项目没通过
FIT=请调用GetReport()获取详细信息

[PIN1:7]
LEVEL= 0
DESC=模板区域特征不明显
FIT=请选择合适的模板区域

[EMPTY:1]
LEVEL = 1
DESC=学习区域为空
FIT=请选择合适的区域

[EMPTY:2]
LEVEL= 1
DESC=两个检测方法都没有选中
FIT=请至少选择一种合适的检测方法

[EMPTY:3]
LEVEL= 1
DESC=灰度模板匹配失败
FIT=请确认是否学习

[EMPTY:4]
LEVEL= 1
DESC=距离检测1失败
FIT=请选择合适的区域,区域尽量和IC边缘重合

[EMPTY:5]
LEVEL= 1
DESC=距离检测2失败
FIT=请选择合适的区域,区域包含托盘空洞,并根据区域空洞边缘角度设置合适的距离检测参数

[EMPTY:6]
LEVEL= 1
DESC=有检测项目没通过
FIT=请调用GetReport()获取详细信息

[EMPTY:7]
LEVEL= 0
DESC=模板区域特征不明显
FIT=请选择合适的模板区域

[MARK:1]
LEVEL= 0
DESC=定位区域1没有找到字符
FIT=请设置合适的定位区域

[MARK:2]
LEVEL= 0
DESC=定位区域2没有找到字符
FIT=请设置合适的定位区域

[MARK:3]
LEVEL= 1
DESC=定位区域为空
FIT=请设置合适的定位区域

[MARK:4]
LEVEL= 1
DESC=定位区域没有找到字符
FIT=请设置合适的定位区域

[MARK:5]
LEVEL= 1
DESC=Mark区域没有找到字符
FIT=请设置合适的Mark区域和灰度阈值

[MARK:6]
LEVEL= 1
DESC=学习过程发生未知异常
FIT=请检查图像和参数设置

[MARK:7]
LEVEL= 1
DESC=没有学习
FIT=请设置合适的参数后学习

[MARK:8]
LEVEL= 1
DESC=没有找到定位模板
FIT=请设置适当的定位区域后学习

[MARK:9]
LEVEL= 1
DESC=定位模板匹配失败
FIT=请检查当前图像IC中Mark与学习图像是否差别太大

[MARK:10]
LEVEL= 1
DESC=有检测项目没通过
FIT=请调用GetReport()获取详细信息

[MARK:11]
LEVEL= 1
DESC=塑封体矩形没有找到
FIT=请检查光源和学习参数

[MARK:12]
LEVEL= 1
DESC=塑封体矩形差别太大
FIT=请检查光源和学习参数



[LEAD:1]
LEVEL= 1
DESC=学习参数设置错误
FIT=请重新检查学习参数

[LEAD:2]
LEVEL= 1
DESC=上边：镜面图像学习参数设置错误
FIT=请重新检查学习参数

[LEAD:3]
LEVEL= 1
DESC=上边:镜面图像旋转处理错误
FIT=请联系系统开发人员检查系统错误

[LEAD:4]
LEVEL= 1
DESC=上边：镜面图像初始定位错误
FIT=请确认镜面图像Lead个数是否与设置值一致，且观察镜面是否灰尘过多

[LEAD:5]
LEVEL= 1
DESC=上边：镜面图像寻找Lead顶点错误
FIT=请检查图像跳变值设置

[LEAD:6]
LEVEL= 1
DESC=上边：镜面图像寻找Lead宽度点1错误
FIT=请检查图像跳变值设置

[LEAD:7]
LEVEL= 1
DESC=上边：镜面图像寻找Lead宽度点2错误
FIT=请检查图像跳变值设置


[LEAD:8]
LEVEL= 1
DESC=上边：镜面图像寻找拐点错误
FIT=请检查镜面图像拐点参数设置

[LEAD:9]
LEVEL= 1
DESC=上边：镜面图像基线坐标还原错误
FIT=

[LEAD:10]
LEVEL= 1
DESC=上边：镜面图像Lead顶点及宽度点坐标还原错误
FIT=

[LEAD:11]
LEVEL= 1
DESC=上边：镜面图像拐点坐标还原错误
FIT=

[LEAD:12]
LEVEL= 1
DESC=右边：镜面图像学习参数设置错误
FIT=请重新检查学习参数

[LEAD:13]
LEVEL= 1
DESC=右边：镜面图像旋转处理错误
FIT=请联系系统开发人员检查系统错误

[LEAD:14]
LEVEL= 1
DESC=右边：镜面图像初始定位错误
FIT=请确认镜面图像Lead个数是否与设置值一致，且观察镜面是否灰尘过多

[LEAD:15]
LEVEL= 1
DESC=右边：镜面图像寻找Lead顶点错误
FIT=请检查图像跳变值设置

[LEAD:16]
LEVEL= 1
DESC=右边：镜面图像寻找Lead宽度点1错误
FIT=请检查图像跳变值设置

[LEAD:17]
LEVEL= 1
DESC=右边：镜面图像寻找Lead宽度点2错误
FIT=请检查图像跳变值设置


[LEAD:18]
LEVEL= 1
DESC=右边：镜面图像寻找拐点错误
FIT=请检查镜面图像拐点参数设置

[LEAD:19]
LEVEL= 1
DESC=右边：镜面图像基线坐标还原错误
FIT=

[LEAD:20]
LEVEL= 1
DESC=右边：镜面图像Lead顶点及宽度点坐标还原错误
FIT=

[LEAD:21]
LEVEL= 1
DESC=右边：镜面图像拐点坐标还原错误
FIT=

[LEAD:22]
LEVEL= 1
DESC=下边：镜面图像学习参数设置错误
FIT=请重新检查学习参数

[LEAD:23]
LEVEL= 1
DESC=下边：镜面图像旋转处理错误
FIT=请联系系统开发人员检查系统错误

[LEAD:24]
LEVEL= 1
DESC=下边：镜面图像初始定位错误
FIT=请确认镜面图像Lead个数是否与设置值一致，且观察镜面是否灰尘过多

[LEAD:25]
LEVEL= 1
DESC=下边：镜面图像寻找Lead顶点错误
FIT=请检查图像跳变值设置

[LEAD:26]
LEVEL= 1
DESC=下边：镜面图像寻找Lead宽度点1错误
FIT=请检查图像跳变值设置

[LEAD:27]
LEVEL= 1
DESC=下边：镜面图像寻找Lead宽度点2错误
FIT=请检查图像跳变值设置


[LEAD:28]
LEVEL= 1
DESC=下边：镜面图像寻找拐点错误
FIT=请检查镜面图像拐点参数设置

[LEAD:29]
LEVEL= 1
DESC=下边：镜面图像基线坐标还原错误
FIT=

[LEAD:30]
LEVEL= 1
DESC=下边：镜面图像Lead顶点及宽度点坐标还原错误
FIT=

[LEAD:31]
LEVEL= 1
DESC=下边：镜面图像拐点坐标还原错误
FIT=

[LEAD:32]
LEVEL= 1
DESC=左边：镜面图像学习参数设置错误
FIT=请重新检查学习参数

[LEAD:33]
LEVEL= 1
DESC=左边：镜面图像旋转处理错误
FIT=请联系系统开发人员检查系统错误

[LEAD:34]
LEVEL= 1
DESC=左边：镜面图像初始定位错误
FIT=请确认镜面图像Lead个数是否与设置值一致，且观察镜面是否灰尘过多

[LEAD:35]
LEVEL= 1
DESC=左边：镜面图像寻找Lead顶点错误
FIT=请检查图像跳变值设置

[LEAD:36]
LEVEL= 1
DESC=左边：镜面图像寻找Lead宽度点1错误
FIT=请检查图像跳变值设置

[LEAD:37]
LEVEL= 1
DESC=左边：镜面图像寻找Lead宽度点2错误
FIT=请检查图像跳变值设置


[LEAD:38]
LEVEL= 1
DESC=左边：镜面图像寻找拐点错误
FIT=请检查镜面图像拐点参数设置

[LEAD:39]
LEVEL= 1
DESC=左边：镜面图像基线坐标还原错误
FIT=

[LEAD:40]
LEVEL= 1
DESC=左边：镜面图像Lead顶点及宽度点坐标还原错误
FIT=

[LEAD:41]
LEVEL= 1
DESC=左边：镜面图像拐点坐标还原错误
FIT=



[LEAD:46]
LEVEL= 1
DESC=产品旋转角度超过8°
FIT=



[LEAD:60]
LEVEL= 1
DESC=2D检测：输入参数错误
FIT=请检测参数是否正确设置

[LEAD:61]
LEVEL= 1
DESC=2D图像检测：Lead顶点搜索错误
FIT=请确定2DLead是否与学习时差别过大，调整2D学习参数

[LEAD:62]
LEVEL= 1
DESC=2D图像检测：Lead宽度点搜索错误
FIT=请调整2D学习参数

[LEAD:63]
LEVEL= 1
DESC=2D图像检测：Lead基点寻找错误
FIT=请调整2D学习参数

[LEAD:64]
LEVEL= 1
DESC=2D图像检测：中间部分管脚数量错误或者管脚有异物
FIT=请确认产品是否完好，如果误判，请调整2D学习参数


[LEAD:80]
LEVEL= 1
DESC=上方：Lead长度不合格
FIT=

[LEAD:81]
LEVEL= 1
DESC=上方：Lead宽度不合格
FIT=

[LEAD:82]
LEVEL= 1
DESC=上方：Lead间距不合格
FIT=

[LEAD:83]
LEVEL= 1
DESC=上方：Lead倾斜度不合格
FIT=

[LEAD:84]
LEVEL= 1
DESC=上方：Lead共面度不合格
FIT=

[LEAD:85]
LEVEL= 1
DESC=上方：Lead差距不合格
FIT=

[LEAD:86]
LEVEL= 1
DESC=上方：Lead站立度不合格
FIT=

[LEAD:87]
LEVEL= 1
DESC=Lead跨度不合格
FIT=

[LEAD:100]
LEVEL= 1
DESC=右方：Lead长度不合格
FIT=

[LEAD:101]
LEVEL= 1
DESC=右方：Lead宽度不合格
FIT=

[LEAD:102]
LEVEL= 1
DESC=右方：Lead间距不合格
FIT=

[LEAD:103]
LEVEL= 1
DESC=右方：Lead倾斜度不合格
FIT=

[LEAD:104]
LEVEL= 1
DESC=右方：Lead共面度不合格
FIT=

[LEAD:105]
LEVEL= 1
DESC=右方：Lead差距不合格
FIT=

[LEAD:106]
LEVEL= 1
DESC=右方：Lead站立度不合格
FIT=

[LEAD:107]
LEVEL= 1
DESC=Lead跨度不合格
FIT=

[LEAD:120]
LEVEL= 1
DESC=下方：Lead长度不合格
FIT=

[LEAD:121]
LEVEL= 1
DESC=下方：Lead宽度不合格
FIT=

[LEAD:122]
LEVEL= 1
DESC=下方：Lead间距不合格
FIT=

[LEAD:123]
LEVEL= 1
DESC=下方：Lead倾斜度不合格
FIT=

[LEAD:124]
LEVEL= 1
DESC=下方：Lead共面度不合格
FIT=

[LEAD:125]
LEVEL= 1
DESC=下方：Lead差距不合格
FIT=

[LEAD:126]
LEVEL= 1
DESC=下方：Lead站立度不合格
FIT=

[LEAD:127]
LEVEL= 1
DESC=Lead跨度不合格
FIT=

[LEAD:140]
LEVEL= 1
DESC=左方：Lead长度不合格
FIT=

[LEAD:141]
LEVEL= 1
DESC=左方：Lead宽度不合格
FIT=

[LEAD:142]
LEVEL= 1
DESC=左方：Lead间距不合格
FIT=

[LEAD:143]
LEVEL= 1
DESC=左方：Lead倾斜度不合格
FIT=

[LEAD:144]
LEVEL= 1
DESC=左方：Lead共面度不合格
FIT=

[LEAD:145]
LEVEL= 1
DESC=左方：Lead差距不合格
FIT=

[LEAD:146]
LEVEL= 1
DESC=左方：Lead站立度不合格
FIT=

[LEAD:147]
LEVEL= 1
DESC=Lead跨度不合格
FIT=
